Repository: CofficLab/GitOK
Catalog: Packages/PluginGitSmartMerge/Resources/Localizable.xcstrings
Source language: en
Languages: zh_hans, zh_hk

source: Analyze
zh_hans: 分析
zh_hk: 分析

source: Branch Aware
zh_hans: 分支感知
zh_hk: 分支感知

source: Conflict Detection
zh_hans: 冲突检测
zh_hk: 衝突檢測

source: Conflict-aware
zh_hans: 冲突感知
zh_hk: 衝突感知

source: Conflicts are listed for resolution; the tree is verified.
zh_hans: 列出冲突待解决，并验证工作树。
zh_hk: 列出衝突待解決，並驗證工作樹。

source: Core Capabilities
zh_hans: 核心能力
zh_hk: 核心能力

source: Git performs the merge with your chosen strategy.
zh_hans: git 按你选择的策略执行合并。
zh_hk: git 按你選擇的策略執行合併。

source: How It Works
zh_hans: 工作原理
zh_hk: 工作原理

source: Merge
zh_hans: 合并
zh_hk: 合併

source: Merge branches
zh_hans: 合并分支
zh_hk: 合併分支

source: Merge paused with %ld conflict file(s)
zh_hans: 合并因 %ld 个冲突文件而暂停
zh_hk: 合併因 %ld 個衝突檔案而暫停

source: Merged %@ into %@
zh_hans: 已将 %@ 合并到 %@
zh_hk: 已將 %@ 合併到 %@

source: Merges can be abandoned cleanly if something feels wrong.
zh_hans: 感觉不对时可以干净地放弃合并。
zh_hk: 感覺不對時可以乾淨地放棄合併。

source: Merges that understand your branches.
zh_hans: 懂你分支的合并。
zh_hk: 懂你分支的合併。

source: Potential conflicts are flagged before you commit to the merge.
zh_hans: 提交合并前即标记潜在冲突。
zh_hk: 提交合並前即標記潛在衝突。

source: Resolve & verify
zh_hans: 解决并验证
zh_hk: 解決並驗證

source: Reversible
zh_hans: 可回退
zh_hk: 可回退

source: Safe
zh_hans: 安全
zh_hk: 安全

source: Select source
zh_hans: 选择源分支
zh_hk: 選擇來源

source: Select target
zh_hans: 选择目标分支
zh_hk: 選擇目標

source: Source
zh_hans: 源分支
zh_hk: 來源

source: Swap branches
zh_hans: 交换分支
zh_hk: 交換分支

source: Target
zh_hans: 目标分支
zh_hk: 目標

source: The divergence between branches is computed.
zh_hans: 计算分支间的分叉情况。
zh_hk: 計算分支間的分叉情況。

source: Understands where your branches diverged and why.
zh_hans: 理解分支从哪里、为何分叉。
zh_hk: 理解分支從哪裏、為何分叉。

source: click to merge
zh_hans: 一键合并
zh_hk: 一鍵合併

source: conflict risk
zh_hans: 冲突风险
zh_hk: 衝突風險

source: into
zh_hans: 合并到
zh_hk: 合併到
